# 2. DataFrame
Two Dimension Data

## Data preparation
use dict to produce
EX) Slam Dunk

In [4]:
data = {
    'Name' : ['Ian', 'Jason', 'Smith', 'John', 'Kara', 'Daisy', 'Jack', 'Poppy'], 
    'School' : ['A1', 'A2', 'A2', 'A1', 'A1', 'A1', 'A2', 'A1'],
    'Height' : ['178', '198', '168', '188', '201', '172', '174', '180'],
    'English' : ['90', '100', '85', '70', '82', '91', '77', '80'],
    'Math' : ['100', '82', '87', '65', '78', '80', '50', '90'],
    'Biology' : ['88', '78', '90', '95', '88', '76', '85', '70'],
    'Coding' : ['Python', '', 'C++', 'Java', '', '', 'R', 'Python']
}
data

{'Name': ['Ian', 'Jason', 'Smith', 'John', 'Kara', 'Daisy', 'Jack', 'Poppy'],
 'School': ['A1', 'A2', 'A2', 'A1', 'A1', 'A1', 'A2', 'A1'],
 'Height': ['178', '198', '168', '188', '201', '172', '174', '180'],
 'English': ['90', '100', '85', '70', '82', '91', '77', '80'],
 'Math': ['100', '82', '87', '65', '78', '80', '50', '90'],
 'Biology': ['88', '78', '90', '95', '88', '76', '85', '70'],
 'Coding': ['Python', '', 'C++', 'Java', '', '', 'R', 'Python']}

In [6]:
data['Name']

['Ian', 'Jason', 'Smith', 'John', 'Kara', 'Daisy', 'Jack', 'Poppy']

In [7]:
data['Height']

['178', '198', '168', '188', '201', '172', '174', '180']

## DataFrame production

In [8]:
import pandas as pd
df = pd.DataFrame(data)

In [9]:
df

    Name School Height English Math Biology  Coding
0    Ian     A1    178      90  100      88  Python
1  Jason     A2    198     100   82      78
2  Smith     A2    168      85   87      90     C++
3   John     A1    188      70   65      95    Java
4   Kara     A1    201      82   78      88
5  Daisy     A1    172      91   80      76
6   Jack     A2    174      77   50      85       R
7  Poppy     A1    180      80   90      70  Python

## Data access

In [10]:
df['Math']

0    100
1     82
2     87
3     65
4     78
5     80
6     50
7     90
Name: Math, dtype: object

In [12]:
df[['Name', 'English']]

    Name English
0    Ian      90
1  Jason     100
2  Smith      85
3   John      70
4   Kara      82
5  Daisy      91
6   Jack      77
7  Poppy      80

## DataFrame (index)

In [14]:
df = pd.DataFrame(data, index=['#1', '#2', '#3', '#4', '#5', '#6', '#7', '#8'])
df

     Name School Height English Math Biology  Coding
#1    Ian     A1    178      90  100      88  Python
#2  Jason     A2    198     100   82      78
#3  Smith     A2    168      85   87      90     C++
#4   John     A1    188      70   65      95    Java
#5   Kara     A1    201      82   78      88
#6  Daisy     A1    172      91   80      76
#7   Jack     A2    174      77   50      85       R
#8  Poppy     A1    180      80   90      70  Python

## DataFrame (column)
Choosing column you want to see

In [15]:
df = pd.DataFrame(data, columns=['Name', 'Math', 'Coding'])
df

    Name Math  Coding
0    Ian  100  Python
1  Jason   82
2  Smith   87     C++
3   John   65    Java
4   Kara   78
5  Daisy   80
6   Jack   50       R
7  Poppy   90  Python

In [16]:
df = pd.DataFrame(data, columns=['Name', 'Coding', 'Math'])
df

    Name  Coding Math
0    Ian  Python  100
1  Jason           82
2  Smith     C++   87
3   John    Java   65
4   Kara           78
5  Daisy           80
6   Jack       R   50
7  Poppy  Python   90